In [2]:
import pandas as pd;

In [3]:
df3 = pd.DataFrame({'nome': ['Caio', 'Rodrigo', 'Rafael', 'Mariane', 'Nathane'], 'identificacao': [1, 2, 3,4 ,5]})

In [4]:
df3

      nome  identificacao
0     Caio              1
1  Rodrigo              2
2   Rafael              3
3  Mariane              4
4  Nathane              5

In [5]:
df3['identificacao_mais_5'] = df3['identificacao'] + 5

In [6]:
df3

      nome  identificacao  identificacao_mais_5
0     Caio              1                     6
1  Rodrigo              2                     7
2   Rafael              3                     8
3  Mariane              4                     9
4  Nathane              5                    10

In [7]:
df3['index'] = 0

In [8]:
df3

      nome  identificacao  identificacao_mais_5  index
0     Caio              1                     6      0
1  Rodrigo              2                     7      0
2   Rafael              3                     8      0
3  Mariane              4                     9      0
4  Nathane              5                    10      0

In [9]:
df3.index = [29, 0, 1, 2222, 88]

In [10]:
df3

         nome  identificacao  identificacao_mais_5  index
29       Caio              1                     6      0
0     Rodrigo              2                     7      0
1      Rafael              3                     8      0
2222  Mariane              4                     9      0
88    Nathane              5                    10      0

In [11]:
df3['nome']

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: nome, dtype: object

In [12]:
df3.nome

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: nome, dtype: object

In [13]:
df3.index

Int64Index([29, 0, 1, 2222, 88], dtype='int64')

In [14]:
df3[['index', 'nome']]

      index     nome
29        0     Caio
0         0  Rodrigo
1         0   Rafael
2222      0  Mariane
88        0  Nathane

In [15]:
df3[df3.identificacao % 2 === 0]

SyntaxError: invalid syntax (2636045237.py, line 1)

In [16]:
df3[df3.identificacao % 2 == 0]

         nome  identificacao  identificacao_mais_5  index
0     Rodrigo              2                     7      0
2222  Mariane              4                     9      0

In [18]:
df3[df3.nome.str.contains('r')]

         nome  identificacao  identificacao_mais_5  index
0     Rodrigo              2                     7      0
2222  Mariane              4                     9      0

In [21]:
df3[(df3.nome.str.contains('r') & (df3.identificacao == 2))]

      nome  identificacao  identificacao_mais_5  index
0  Rodrigo              2                     7      0

In [22]:
df3[(df3.nome.str.contains('r') | (df3.identificacao == 2))]

         nome  identificacao  identificacao_mais_5  index
0     Rodrigo              2                     7      0
2222  Mariane              4                     9      0

In [23]:
df3.loc[0]

nome                    Rodrigo
identificacao                 2
identificacao_mais_5          7
index                         0
Name: 0, dtype: object

In [24]:
df3.iloc[0]

nome                    Caio
identificacao              1
identificacao_mais_5       6
index                      0
Name: 29, dtype: object

In [26]:
df3[0:2]

       nome  identificacao  identificacao_mais_5  index
29     Caio              1                     6      0
0   Rodrigo              2                     7      0

In [27]:
df3

         nome  identificacao  identificacao_mais_5  index
29       Caio              1                     6      0
0     Rodrigo              2                     7      0
1      Rafael              3                     8      0
2222  Mariane              4                     9      0
88    Nathane              5                    10      0

In [28]:
df3[0:2]

       nome  identificacao  identificacao_mais_5  index
29     Caio              1                     6      0
0   Rodrigo              2                     7      0

In [31]:
df3.loc[0:1]

      nome  identificacao  identificacao_mais_5  index
0  Rodrigo              2                     7      0
1   Rafael              3                     8      0

In [32]:
df3.dtypes

nome                    object
identificacao            int64
identificacao_mais_5     int64
index                    int64
dtype: object

In [36]:
df3.identificacao = df3.identificacao.astype(str)

C:\Users\PC\AppData\Local\Temp\ipykernel_12996\2122338247.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df3.identificacao = df3.identificacao.str

In [35]:
df3.dtypes

nome                    object
identificacao           object
identificacao_mais_5     int64
index                    int64
dtype: object

In [37]:
df3['teste1'] = [None, 2, 4, None, 10]

In [38]:
df3

         nome identificacao  identificacao_mais_5  index  teste1
29       Caio             1                     6      0     NaN
0     Rodrigo             2                     7      0     2.0
1      Rafael             3                     8      0     4.0
2222  Mariane             4                     9      0     NaN
88    Nathane             5                    10      0    10.0

In [39]:
type(NaN)

NameError: name 'NaN' is not defined

In [40]:
df3.columns

Index(['nome', 'identificacao', 'identificacao_mais_5', 'index', 'teste1'], dtype='object')

In [41]:
df3.columns = ['nome', 'identificacao', 'identificacao_mais_5', 'index_modificado', 'teste1']

In [42]:
df3

         nome identificacao  identificacao_mais_5  index_modificado  teste1
29       Caio             1                     6                 0     NaN
0     Rodrigo             2                     7                 0     2.0
1      Rafael             3                     8                 0     4.0
2222  Mariane             4                     9                 0     NaN
88    Nathane             5                    10                 0    10.0

In [43]:
df3.shape

(5, 5)